backend/controllers/CategoryController.php

    public function actionEdit(){
        $post = Yii::$app->request->post();

        if(
            (mb_strlen($post['cate_name']) < 2 || mb_strlen($post['cate_name']) > 16) ||
            (!is_numeric($post['id']) || $post['id'] < 1) ||
            (!is_numeric($post['cate_level']) || !in_array($post['cate_level'], [1,2]))
        ){
            $this->error();
        }

        if($post['cate_level'] == 1){
            if(!is_numeric($post['cate_sort']) || $post['cate_sort'] < 0){
                $this->error();
            }
        }

        $model = Category::findOne((int)$post['id']);
---
SELECT * FROM `category` WHERE `id`=20