backend/controllers/NewsController.php

SELECT * FROM `news` WHERE `id`='8'
UPDATE `news` SET `status`=1 WHERE `id`=22
---
    public function actionUpdate(){
        $post = Yii::$app->request->post();
        if(!is_numeric($post['id']) || $post['id'] <= 0 || !in_array($post['type'], [1,2,3])){
            $this->error();
        }

        $status = $post['type'] == 1 ? 2 : ($post['type'] == 2 ? 1 : -9);
        $model = News::findOne($post['id']);
        if($model === null){
            $this->error();
        }

        $model->setScenario('delete');
        $model->status = $status;
        if($model->save()){