backend/controllers/ProductController.php

        }

        if($optype == 'update'){
            $model = Product::findOne((int)$id);
---
SELECT * FROM `product` WHERE `id`=28

    public function actionUpdate(){
        $res = [];
        $fType = Yii::$app->request->get('ca_f');
        $sType = Yii::$app->request->get('ca_s');
        $id = Yii::$app->request->get('id');

        if(
            !is_numeric($fType) || $fType < 0 ||
            !is_numeric($sType) || $sType < 0 ||
            !is_numeric($id) || $id < 0
        ){
            throw new NotFoundHttpException('Page Not Found');
        }

        $model = Product::findOne($id);
---
SELECT * FROM `product` WHERE `id`='15'