backend/models/Banner.php

    public function getBannerInfoById(int $id){
        $meau = self::findOne($id);
---
SELECT * FROM `banner` WHERE `id`=1