backend/models/Cases.php

SELECT COUNT(*) FROM `case` WHERE (`category`=16) AND (`status`=1)
---
    public function getCaseCountByType(int $type){
        return (self::find())->where([
            'category' => $type,
            'status' => 1]
            )->count();

SELECT * FROM `case` WHERE (`category`=16) AND (`status`=1) ORDER BY `ctime` DESC LIMIT 10
---
    public function getCaseListByType(int $type, int $offset = 0, int $limit = 10){
        $query = self::find();

        $query->where(['category' => $type,'status' => 1])->orderBy('ctime DESC');
        return $query->offset($offset)->limit($limit)->all();