backend/models/Category.php

    public function getSecondLevelCategoryById(int $id, int $offset = 0, int $limit = 3){
        $query = self::find();

        $query->where(['pid' => $id,'status' => 1]);
        return $query->offset($offset)->limit($limit)->all();
---
SELECT * FROM `category` WHERE `type`= 1 AND `status` = 1