backend/models/News.php

    public function getNewsCountByType(int $type){
        return (self::find())->where([
            'category' => $type
            ])->andWhere(['<>', 'status', -9])->count();
---
SELECT COUNT(*) FROM `news` WHERE (`category`=9) AND (`status` <> -9)

    public function getNewsListByType(int $type, int $offset = 0, int $limit = 10){
        $query = self::find();

        $query->where(['category' => $type])->andWhere(['<>', 'status', -9]);
        $query->orderBy('ctime DESC');
        return $query->offset($offset)->limit($limit)->all();
---
SELECT * FROM `news` WHERE (`category`=9) AND (`status` <> -9) ORDER BY `ctime` DESC LIMIT 10