backend/models/Product.php

    public function getProductCountByType(int $ftype = 0, int $stype = 0){
        $model = self::find();
        $model->where(['status' => 1]);

        if($ftype > 0){
            $model->andWhere(['pro_first_type' => (int)$ftype]);
        }

        if($stype > 0){
            $model->andWhere(['pro_second_type' => (int)$stype]);
        }

        return $model->count();
---
SELECT COUNT(*) FROM `product` WHERE (`status`=1) AND (`pro_first_type`=2) AND (`pro_second_type`=23)

    public function getProductListByType(int $ftype = 0, int $stype = 0, int $offset = 0, int $limit = 15){
        $model = self::find();
        $model->where(['status' => 1]);

        if($ftype > 0){
            $model->andWhere(['pro_first_type' => (int)$ftype]);
        }

        if($stype > 0){
            $model->andWhere(['pro_second_type' => (int)$stype]);
        }

        return $model->orderBy('ctime DESC')
            ->offset($offset)
            ->limit($limit)
            ->all();
---
SELECT * FROM `product` WHERE (`status`=1) AND (`pro_first_type`=2) AND (`pro_second_type`=23) ORDER BY `ctime` DESC LIMIT 15