backend/models/Support.php

    public function getSupportCount(){
        return (self::find())->where([
            'status' => 1]
            )->count();
---
SELECT COUNT(*) FROM `support` WHERE `status`=1

    public function getSupportList(int $offset = 0, int $limit = 10){
        $query = self::find();

        $query->where(['status' => 1])
            ->select(['id','pic','title','en_title','ctime','url','category']);
        return $query->offset($offset)->limit($limit)->all();
---
SELECT `id`, `pic`, `title`, `ctime`, `url`, `category` FROM `support` WHERE `status`=1 LIMIT 10